marco-2.md
```mermaid
erDiagram
    Dim_Tempo ||--o{ Fato_Respostas : TempoKey
    Dim_Aluno_Anonimo ||--o{ Fato_Respostas : AlunoKey
    Dim_Questao ||--o{ Fato_Respostas : QuestaoKey
    Dim_Simulado ||--o{ Fato_Respostas : SimuladoKey

    Fato_Respostas {
        int RespostaKey PK
        int TempoKey FK
        int AlunoKey FK
        int QuestaoKey FK
        int SimuladoKey FK
        string RespostaDada
        int Acertou
        float TempoRespostaSegundos
    }

    Dim_Tempo {
        int TempoKey PK
        date Data
        int Ano
        int Mes
        string NomeMes
        int SemanaSemestre
    }

    Dim_Aluno_Anonimo {
        int AlunoKey PK
        string CodigoAlunoAnonimo
        string TurmaGrupo
    }

    Dim_Questao {
        int QuestaoKey PK
        string CodigoQuestao
        string EixoTematico
        string NivelDificuldade
    }

    Dim_Simulado {
        int SimuladoKey PK
        string CodigoSimulado
        int NumeroAplicacao
        string DescricaoSimulado
    }
```
